Autodesk.Revit.DB.ATFBaseExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ATFBaseExportOptions.ViewId
The element id of the 3D view to export. InvalidElementId by default.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2021.1

Autodesk.Revit.DB.ATFBaseExportOptions
The base class for options used to export STL, XML and SAT format files (using ATF).
Since:
2021.1